In [2]:
import pandas as pd

namedf=pd.read_csv('/Users/hubertcheung/Downloads/temp.csv')

In [74]:
nameparse=namedf['name'].str.split()
print(nameparse)

0                           [TOHKAI, THERMO, (HK), CO, LTD]
1          [LEE, WAI, HONG, &, NGAN, TIK, HAN, NDIYA, (JT)]
2                                         [CHAN, WAI, LUEN]
3                                       [LAP, WIN, CO, LTD]
4                                    [LI, YEE, LIN, ELAINE]
                                 ...
2261121            [LIU, WING, KAI, &, LO, LAI, YING, (JT)]
2261122        [LEUNG, TIM, &, LEUNG, CHIM, YAN, IDY, (JT)]
2261123         [MOK, KANG, MING, &, LEE, CHI, CHING, (JT)]
2261124                                 [HAU, SIU, PO, 1/2]
2261125           [NG, KATHERINE, &, LI, CHOR, KEUNG, (JT)]
Name: name, Length: 2261126, dtype: object

In [78]:
nameparse = nameparse[nameparse.apply(lambda x: (isinstance(x, list) and len(x)>0 and x[-1] != 'LTD'))]
nameparse

1          [LEE, WAI, HONG, &, NGAN, TIK, HAN, NDIYA, (JT)]
2                                         [CHAN, WAI, LUEN]
4                                    [LI, YEE, LIN, ELAINE]
5                  [CHU, MING, WAH, &, YU, LAI, PING, (JT)]
6                  [CHU, PO, LUN, &, LAU, SHUK, MING, (JT)]
                                 ...
2261121            [LIU, WING, KAI, &, LO, LAI, YING, (JT)]
2261122        [LEUNG, TIM, &, LEUNG, CHIM, YAN, IDY, (JT)]
2261123         [MOK, KANG, MING, &, LEE, CHI, CHING, (JT)]
2261124                                 [HAU, SIU, PO, 1/2]
2261125           [NG, KATHERINE, &, LI, CHOR, KEUNG, (JT)]
Name: name, Length: 2033466, dtype: object

In [26]:
with open('output.txt', 'r', encoding='utf-8') as file:
    lines = file.readlines()

canton = [line.strip() for line in lines]

In [80]:
onename = nameparse[nameparse.astype(str).apply(lambda x: '&' not in x)]

In [86]:
#Those with only one element is weird and should be picked out
singleelement = onename[onename.apply(lambda x:len(x)==1)]
onename = onename[onename.apply(lambda x:len(x)!=1)]

In [93]:
HKname = onename[onename.apply(lambda x: x[0] in canton or x[1] in canton)]
HKname

2               [CHAN, WAI, LUEN]
4          [LI, YEE, LIN, ELAINE]
7              [KERK, CHUN, LUNG]
10               [CHOW, YUK, LAM]
11             [CHEUNG, HON, MAN]
                    ...
2261109       [MA, KA, WING, 1/3]
2261110         [CHAN, CHOI, PIK]
2261113      [WU, KWAN, KIN, KEN]
2261117                [WOO, KIN]
2261124       [HAU, SIU, PO, 1/2]
Name: name, Length: 723891, dtype: object

In [94]:
notHKname = onename[~onename.apply(lambda x: x[0] in canton or x[1] in canton)]
notHKname

50         [RICHARDSON, DAVID, CHANNING]
80                          [HU, JACHIN]
102                      [ZOU, ZHONGHUA]
104                       [SHIH, PHILIP]
146                       [BURHAN, URAY]
                       ...
2260848           [ZHANG, MIN, ISABELLE]
2260935               [LEONG, BUT, YING]
2261066       [CHARLTON, TIMOTHY, JAMES]
2261079             [HUANG, HSIEH, LIEN]
2261099                 [INAGAWA, KAZUO]
Name: name, Length: 76102, dtype: object

In [101]:
notHKname_df = notHKname.to_frame()
notHKname_df.to_csv('notHKname.csv')

                                  name
50       [RICHARDSON, DAVID, CHANNING]
80                        [HU, JACHIN]
102                    [ZOU, ZHONGHUA]
104                     [SHIH, PHILIP]
146                     [BURHAN, URAY]
...                                ...
2260848         [ZHANG, MIN, ISABELLE]
2260935             [LEONG, BUT, YING]
2261066     [CHARLTON, TIMOTHY, JAMES]
2261079           [HUANG, HSIEH, LIEN]
2261099               [INAGAWA, KAZUO]

[76102 rows x 1 columns]